Revit 2024 API
BuiltInFailures.WallFailures.ConstrainedToWallError Property
 Sketch Lines created with Pick Wall must remain parallel to the Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ConstrainedToWallError { get; }
Visual Basic
Public Shared ReadOnly Property ConstrainedToWallError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ConstrainedToWallError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace